In [85]:
import pandas as pd

In [86]:
df = pd.DataFrame([[10, 20, 30, 40],
                   [50, 60, 70, 80],
                   [90, 100, 110, 120]],
                   index=list('xyz'),
                   columns=list('abcd'))

In [87]:
df

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

In [88]:
df[['a', 'b']]

    a    b
x  10   20
y  50   60
z  90  100

In [89]:
# df['x'] # will raise a KeyErrorException as pandas will look for a column name x

In [90]:
df.loc['x'] # to retrieve the row at index x we should use this as its a series or we can use df.iloc[0]

a    10
b    20
c    30
d    40
Name: x, dtype: int64

In [91]:
df['x': 'z'] # Exception to pandas rule when we use a splice operator pandas will look in the indexes for that

    a    b    c    d
x  10   20   30   40
y  50   60   70   80
z  90  100  110  120

# Exercise 8 • Net revenue
For many pandas users, it’s rare to create a new data frame from scratch. We import a CSV file, or we perform transformations on an existing data frame (or several existing series). But sometimes we need to create a new data frame—for example, when assembling data from nonstandard sources or experimenting with new pandas techniques—and knowing how to do so can be useful.

For this exercise, I want you to create a data frame that represents a company’s inventory of five products. Each product has a unique ID number (a two-digit integer will do), name, wholesale price, retail price, and number of sales in the last month. You’re making it up, so if you’ve always wanted to be a profitable starship dealer, this is your chance! Once you have created this data frame, calculate the total net revenue from all your products.

In [104]:
df = pd.DataFrame([
    {'product_id': 23, 'name': 'computer', 'wholesale_price': 500, 'retail_price': 1000, 'sales': 100},
    {'product_id': 96, 'name': 'python book', 'wholesale_price': 35, 'retail_price': 75, 'sales': 1000},
    {'product_id': 97, 'name': 'pandas book', 'wholesale_price': 35, 'retail_price': 75, 'sales': 500},
    {'product_id': 15, 'name': 'apple', 'wholesale_price': 0.5, 'retail_price': 1, 'sales': 200},
])

In [105]:
print(f"Net: {( (df['retail_price'] - df['wholesale_price']) * df['sales'] ).sum()}")

Net: 110100.0

In [106]:
df['name'][df['retail_price'] * 0.5 > df['wholesale_price']] # retail price twice the wholesale price

1    python book
2    pandas book
Name: name, dtype: object

In [107]:
# net revenue from computer sales
((df['retail_price'] - df['wholesale_price']) * df['sales'])[0].sum()

np.float64(50000.0)

In [108]:
# net revenue from book sales
((df['retail_price'] - df['wholesale_price']) * df['sales'])[[1, 2]].sum()

np.float64(60000.0)

In [109]:
# net revenue from food sales
((df['retail_price'] - df['wholesale_price']) * df['sales'])[3].sum()

np.float64(100.0)

In [110]:
# lets say we get 30 % discount on wholesale price calculate the net revenue
((df['retail_price'] - df['wholesale_price'] * 0.7)*df['sales']).sum()

np.float64(140880.0)

# Exercise 9 • Tax planning

In the previous exercise, you created a data frame representing your store’s products and sales. In this exercise, you will extend that data frame (literally). It’s pretty common to add columns to an existing data frame, either to add new information you’ve acquired or to store the results of per-row calculations—which is what you’ll do now. A common reason to add a column is to hold intermediate values as a convenience.

The backstory for this exercise is as follows. Your local government is thinking about imposing a sales tax and is considering 15%, 20%, and 25% rates. Show how much less you would net with each of these tax amounts by adding columns to the data frame for your net income under each of the proposed rates, as well as your current net income.

In [115]:
df['current_net'] = (df['retail_price'] - df['wholesale_price']) * df['sales']
# or we can use the assign method
# df.assign(current_net = (df['retail_price'] - df['wholesale_price']) * df['sales'])
df

   product_id         name  wholesale_price  retail_price  sales  current_net
0          23     computer            500.0          1000    100      50000.0
1          96  python book             35.0            75   1000      40000.0
2          97  pandas book             35.0            75    500      20000.0
3          15        apple              0.5             1    200        100.0

In [116]:
df['after_15_tax'] = df['current_net'] * 0.85
df['after_20_tax'] = df['current_net'] * 0.80
df['after_25_tax'] = df['current_net'] * 0.75
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_15_tax,after_20_tax,after_25_tax
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,python book,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,pandas book,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,apple,0.5,1,200,100.0,85.0,80.0,75.0

In [117]:
df[['current_net', 'after_15_tax', 'after_20_tax', 'after_25_tax']].sum()

current_net     110100.0
after_15_tax     93585.0
after_20_tax     88080.0
after_25_tax     82575.0
dtype: float64

##### Retrieving and assigning with loc

In [118]:
df2 = pd.DataFrame({
    'v': [10, 20, 30, 40, 50],
    'w': [15, 25, 35, 45, 55],
    'x': [11, 22, 33, 44, 56],
    'y': [71, 14, 47, 59, 69],
    'z': [21, 23, 26, 87, 99]
}, index=list('abcde'))

In [119]:
df2

    v   w   x   y   z
a  10  15  11  71  21
b  20  25  22  14  23
c  30  35  33  47  26
d  40  45  44  59  87
e  50  55  56  69  99

In [120]:
print(df2.loc['a', 'x'])
print(df2.loc[['a', 'c'], 'x']) # rows a and c and col x
print(df2.loc['a', ['x', 'y']]) # row a and cols x and y
print(df2.loc[['a', 'c'], ['x', 'y']]) # rows a and c and cols x and y

11
a    11
c    33
Name: x, dtype: int64
x    11
y    71
Name: a, dtype: int64
    x   y
a  11  71
c  33  47

In [121]:
print(df2.loc['c', df2.loc['d'] > 45])

y    47
z    26
Name: c, dtype: int64

# Exercise 10 • Adding new products
Good news! Your store is making money, and you have decided to add some new products. I’d like you to do that by creating a new data frame and adding it to the existing one. This new data frame should contain three products (including product ID, name, wholesale price, and retail price):

* Phone, with an ID of 24, a wholesale price of 200, and a retail price of 500

* Apple, with an ID of 16, a wholesale price of 0.5, and a retail price of 1

* Pear, with an ID of 17, a wholesale price of 0.6, and a retail price of 1.2

Because these are new products, don’t include the sales column. And to avoid problems and conflicts, ensure that the indexes of these new products are different from existing product indexes. (In chapter 4, we’ll look at some ways to handle index problems more elegantly.)

Once you have added these new products, assign sales figures to each of them. Finally, recalculate the store’s total net income, including the new products.

In [122]:
new_products = pd.DataFrame([
    {'product_id': 24, 'name': 'phone', 'wholesale_price': 200, 'retail_price': 500},
    {'product_id': 16, 'name': 'guava', 'wholesale_price': 0.5, 'retail_price': 1},
    {'product_id': 17, 'name': 'pear', 'wholesale_price': 0.6, 'retail_price': 1.2},
], index=range(4,7))

In [123]:
new_products

   product_id   name  wholesale_price  retail_price
4          24  phone            200.0         500.0
5          16  guava              0.5           1.0
6          17   pear              0.6           1.2

In [124]:
df = pd.concat([df, new_products])
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_15_tax,after_20_tax,after_25_tax
0,23,computer,500.0,1000.0,100.0,50000.0,42500.0,40000.0,37500.0
1,96,python book,35.0,75.0,1000.0,40000.0,34000.0,32000.0,30000.0
2,97,pandas book,35.0,75.0,500.0,20000.0,17000.0,16000.0,15000.0
3,15,apple,0.5,1.0,200.0,100.0,85.0,80.0,75.0
4,24,phone,200.0,500.0,NaN,NaN,NaN,NaN,NaN
5,16,guava,0.5,1.0,NaN,NaN,NaN,NaN,NaN
6,17,pear,0.6,1.2,NaN,NaN,NaN,NaN,NaN

In [125]:
df.loc[[4, 5, 6], 'sales'] = [100, 200, 75]
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_15_tax,after_20_tax,after_25_tax
0,23,computer,500.0,1000.0,100.0,50000.0,42500.0,40000.0,37500.0
1,96,python book,35.0,75.0,1000.0,40000.0,34000.0,32000.0,30000.0
2,97,pandas book,35.0,75.0,500.0,20000.0,17000.0,16000.0,15000.0
3,15,apple,0.5,1.0,200.0,100.0,85.0,80.0,75.0
4,24,phone,200.0,500.0,100.0,NaN,NaN,NaN,NaN
5,16,guava,0.5,1.0,200.0,NaN,NaN,NaN,NaN
6,17,pear,0.6,1.2,75.0,NaN,NaN,NaN,NaN

In [128]:
for i in range(4, 7):
    df.loc[i, 'current_net'] = (df.loc[i, 'retail_price'] - df.loc[i, 'wholesale_price']) * df.loc[i, 'sales']
df

,product_id,name,wholesale_price,retail_price,sales,current_net,after_15_tax,after_20_tax,after_25_tax
0,23,computer,500.0,1000.0,100.0,50000.0,42500.0,40000.0,37500.0
1,96,python book,35.0,75.0,1000.0,40000.0,34000.0,32000.0,30000.0
2,97,pandas book,35.0,75.0,500.0,20000.0,17000.0,16000.0,15000.0
3,15,apple,0.5,1.0,200.0,100.0,85.0,80.0,75.0
4,24,phone,200.0,500.0,100.0,30000.0,NaN,NaN,NaN
5,16,guava,0.5,1.0,200.0,100.0,NaN,NaN,NaN
6,17,pear,0.6,1.2,75.0,45.0,NaN,NaN,NaN

##### Query method

In [129]:
df2.query('v > 30')

    v   w   x   y   z
d  40  45  44  59  87
e  50  55  56  69  99

In [132]:
df2.query('v > 30 & y % 3 == 0')

    v   w   x   y   z
e  50  55  56  69  99

# Exercise 11 • Bestsellers
You’re going to use the online store for one final exercise. This time, I want you to find the IDs and names of products that have sold more than the average number of units.

In [133]:
df.loc[
    df['sales'] > df['sales'].mean(),
    ['product_id', 'name']
]

   product_id         name
1          96  python book
2          97  pandas book

In [134]:
# using query
df.query('sales > sales.mean()')[['product_id', 'name']]

   product_id         name
1          96  python book
2          97  pandas book

In [138]:
# show id and name of products whose net income is in the top 25%quantile
df.loc[
    df['current_net'] > df['current_net'].quantile(.75),
    ['product_id', 'name']
]

   product_id         name
0          23     computer
1          96  python book

In [139]:
# using query
df.query('current_net > current_net.quantile(0.75)')[['product_id', 'name']]

   product_id         name
0          23     computer
1          96  python book

# Exercise 14 • Selective updating
In this exercise, I want you to create the same two-column data frame as in the last exercise. Then, update the values in the temp column so that any value less than 0 is set to 0.

In [145]:
s = pd.read_csv('data/nyc-temps.txt').squeeze()
df = pd.DataFrame({
    'temp': s,
    'hour': [0, 3, 6, 9, 12, 15, 18, 21] * 91
})
df

     temp  hour
0      -1     0
1      -1     3
2      -1     6
3      -1     9
4      -1    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [147]:
df.loc[df['temp'] < 0, 'temp'] = 0